gibix/zephyr/soc/microchip/pic32c/pic32ck_sg_gc/pic32ck_gc01/soc.h
/*
 * Copyright (c) 2026 Microchip Technology Inc.
 *
 * SPDX-License-Identifier: Apache-2.0
 */

#ifndef SOC_MICROCHIP_PIC32CK_GC01_H_
#define SOC_MICROCHIP_PIC32CK_GC01_H_

#ifndef _ASMLANGUAGE

#include <zephyr/types.h>

#if defined(CONFIG_SOC_PIC32CK0512GC01064)
#include "pic32ck0512gc01064.h"
#elif defined(CONFIG_SOC_PIC32CK0512GC01100)
#include "pic32ck0512gc01100.h"
#elif defined(CONFIG_SOC_PIC32CK1012GC01048)
#include "pic32ck1012gc01048.h"
#elif defined(CONFIG_SOC_PIC32CK1012GC01064)
#include "pic32ck1012gc01064.h"
#elif defined(CONFIG_SOC_PIC32CK1012GC01100)
#include "pic32ck1012gc01100.h"
#elif defined(CONFIG_SOC_PIC32CK1025GC01064)
#include "pic32ck1025gc01064.h"
#elif defined(CONFIG_SOC_PIC32CK1025GC01100)
#include "pic32ck1025gc01100.h"
#elif defined(CONFIG_SOC_PIC32CK1025GC01144)
/*
 * The Microchip HAL does not ship a dedicated CMSIS header for the
 * 1025/144 SKU. The CMSIS-level definitions (NVIC, MPU, SCB, ...) are
 * identical across flash variants in the same package, so we reuse the
 * 2051/144 header. Flash size is taken from the devicetree, not from
 * this header.
 */
#include "pic32ck2051gc01144.h"
#elif defined(CONFIG_SOC_PIC32CK2051GC01064)
#include "pic32ck2051gc01064.h"
#elif defined(CONFIG_SOC_PIC32CK2051GC01100)
#include "pic32ck2051gc01100.h"
#elif defined(CONFIG_SOC_PIC32CK2051GC01144)
#include "pic32ck2051gc01144.h"
#else
#error "Library does not support the specified device."
#endif

#include "pic32ck_sg_gc.h"

#endif /* _ASMLANGUAGE */

#endif /* SOC_MICROCHIP_PIC32CK_GC01_H_ */
